Clash Bot Workflow - plan
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Workflow Plan 📖`failure`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

#### Prerequisites
```

terraform
module.create_team_step_function.data.aws_caller_identity.current: Reading...
data.aws_acm_certificate.issued: Reading...
module.create_team_step_function.data.aws_region.current[0]: Reading...
data.aws_s3_bucket.lambda_bucket: Reading...
module.create_team_step_function.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
module.create_team_step_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.create_team_step_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=4239894905]
module.create_team_step_function.data.aws_caller_identity.current: Read complete after 0s [id=816923827429]
module.create_team_step_function.data.aws_iam_policy_document.service["dynamodb"]: Reading...
module.create_team_step_function.data.aws_iam_policy_document.service["dynamodb"]: Read complete after 0s [id=2739711238]
data.aws_acm_certificate.issued: Read complete after 1s [id=arn:aws:acm:us-east-1:816923827429:certificate/1d277044-1781-46f9-b693-50c8ff95546a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_iam_role.lambda_handler_exec will be created
  + resource "aws_iam_role" "lambda_handler_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "clash_bot_lambda_event_handler_exec_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Application" = "ClashBot"
          + "Environment" = "dev"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.lambda_publisher_exec will be created
  + resource "aws_iam_role" "lambda_publisher_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "clash_bot_lambda_event_publisher_exec_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Application" = "ClashBot"
          + "Environment" = "dev"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_handler_exec_policy will be created
  + resource "aws_iam_role_policy_attachment" "lambda_handler_exec_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "clash_bot_lambda_event_handler_exec_role"
    }

  # aws_iam_role_policy_attachment.lambda_publisher_exec_policy will be created
  + resource "aws_iam_role_policy_attachment" "lambda_publisher_exec_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "clash_bot_lambda_event_publisher_exec_role"
    }

  # module.api_gateway.aws_apigatewayv2_api.this[0] will be created
  + resource "aws_apigatewayv2_api" "this" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + description                  = "Clash Bot Workflow API Gateway for the dev environment"
      + disable_execute_api_endpoint = false
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "clash-bot-workflow-dev"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = {
          + "Application" = "ClashBot"
          + "Environment" = "dev"
        }

      + cors_configuration {
          + allow_headers = [
              + "authorization",
              + "content-type",
              + "x-amz-date",
              + "x-amz-security-token",
              + "x-amz-user-agent",
              + "x-api-key",
            ]
          + allow_methods = [
              + "*",
            ]
          + allow_origins = [
              + "*",
            ]
        }
    }

  # module.api_gateway.aws_apigatewayv2_domain_name.this[0] will be created
  + resource "aws_apigatewayv2_domain_name" "this" {
      + api_mapping_selection_expression = (known after apply)
      + arn                              = (known after apply)
      + domain_name                      = "dev.clash-bot.ninja"
      + id                               = (known after apply)
      + tags_all                         = {
          + "Application" = "ClashBot"
          + "Environment" = "dev"
        }

      + domain_name_configuration {
          + certificate_arn                        = "arn:aws:acm:us-east-1:816923827429:certificate/1d277044-1781-46f9-b693-50c8ff95546a"
          + endpoint_type                          = "REGIONAL"
          + hosted_zone_id                         = (known after apply)
          + ownership_verification_certificate_arn = (known after apply)
          + security_policy                        = "TLS_1_2"
          + target_domain_name                     = (known after apply)
        }
    }

  # module.clash_bot_event_sqs.aws_sqs_queue.this[0] will be created
  + resource "aws_sqs_queue" "this" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = true
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "clash-bot-event-sqs-dev.fifo"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = true
      + tags_all                          = {
          + "Application" = "ClashBot"
          + "Environment" = "dev"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.create_team_step_function.aws_iam_policy.service["dynamodb"] will be created
  + resource "aws_iam_policy" "service" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "retrieve-teams-dev-dynamodb"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:UpdateItem",
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                          + "dynamodb:DeleteItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:us-east-1:816923827429:table/sample-table"
                      + Sid      = "dynamodbDynamodb"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Application" = "ClashBot"
          + "Environment" = "dev"
        }
    }

  # module.create_team_step_function.aws_iam_policy_attachment.service["dynamodb"] will be created
  + resource "aws_iam_policy_attachment" "service" {
      + id         = (known after apply)
      + name       = "retrieve-teams-dev-dynamodb"
      + policy_arn = (known after apply)
      + roles      = [
          + "retrieve-teams-dev",
        ]
    }

  # module.create_team_step_function.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.us-east-1.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "retrieve-teams-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Application" = "ClashBot"
          + "Environment" = "dev"
        }
      + unique_id             = (known after apply)
    }

  # module.create_team_step_function.aws_sfn_state_machine.this[0] will be created
  + resource "aws_sfn_state_machine" "this" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = <<-EOT
            {
                "Comment": "A Hello World example of the Amazon States Language using Pass states",
                "StartAt": "Hello",
                "States": {
                  "Hello": {
                    "Type": "Pass",
                    "Result": "Hello",
                    "Next": "World"
                  },
                  "World": {
                    "Type": "Pass",
                    "Result": "World",
                    "End": true
                  }
                }
              }
        EOT
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "retrieve-teams-dev"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Name" = "retrieve-teams-dev"
        }
      + tags_all                  = {
          + "Application" = "ClashBot"
          + "Environment" = "dev"
          + "Name"        = "retrieve-teams-dev"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)

      + timeouts {}
    }

Plan: 11 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @Poss111, Action: `pull_request`*